app/controllers/comments_controller.rb

	def create
		@comment = @message.comments.create(comment_params)
		@comment.user_id = current_user.id

		if @comment.save
---
INSERT INTO "comments" ("content", "message_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Its the nicest car ever i have seen!!"], ["message_id", 16], ["user_id", 2], ["created_at", "2022-11-02 07:38:13.081463"], ["updated_at", "2022-11-02 07:38:13.081463"]]
INSERT INTO "comments" ("content", "message_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "testing comment"], ["message_id", 20], ["user_id", 2], ["created_at", "2022-11-09 06:47:39.628775"], ["updated_at", "2022-11-09 06:47:39.628775"]]