app/controllers/messages_controller.rb

	def create
		@message = current_user.messages.build(message_params)
		if @message.save
---
INSERT INTO "messages" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "furafuriii"], ["description", "konalach nhi mahiti"], ["created_at", "2022-11-01 10:26:18.912109"], ["updated_at", "2022-11-01 10:26:18.912109"], ["user_id", 3]]

	def update
		@message = Message.find(params[:id])
		if @message.update(message_params)
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "messages" SET "description" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["description", "ssssssssssssssssssssssssssssssssssss"], ["updated_at", "2022-11-02 07:45:07.955417"], ["id", 16]]